'''

시간 제한	메모리 제한	제출	정답	맞은 사람	정답 비율
2 초	128 MB	115390	38242	24030	32.111%
문제
정수 X에 사용할 수 있는 연산은 다음과 같이 세 가지 이다.

X가 3으로 나누어 떨어지면, 3으로 나눈다.
X가 2로 나누어 떨어지면, 2로 나눈다.
1을 뺀다.
정수 N이 주어졌을 때, 위와 같은 연산 세 개를 적절히 사용해서 1을 만들려고 한다. 연산을 사용하는 횟수의 최솟값을 출력하시오.

입력
첫째 줄에 1보다 크거나 같고, 106보다 작거나 같은 정수 N이 주어진다.

출력
첫째 줄에 연산을 하는 횟수의 최솟값을 출력한다.

예제 입력 1
2
예제 출력 1
1
예제 입력 2
10
예제 출력 2
3
'''
n = int(input())

dp = [0 for _ in range(n + 1)]

for i in range(2, n + 1):
    dp[i] = dp[i - 1] + 1      #기본적으로 1빼는 연산이기때문에 전값에서 count하나 증가

    if i % 2 == 0 and dp[i] > dp[i // 2] + 1:  # 2으로 나눠진다면  2로 나눈 결과의 배열 count값에서 1 더함 ex) 6일때(dp[6]) 3의(dp[6//2=3] 값에서 1더함
        dp[i] = dp[i // 2] + 1                 # 단순히 전 값에서 1더한것보다 효율적이면 불러옴

    if i % 3 == 0 and dp[i] > dp[i // 3] + 1:  # 3으로 나눠진다면 ''
        dp[i] = dp[i // 3] + 1

print(dp[n])

'''
입력값 크기의 배열을 생성하고 2부터 하나씩 올라가면서 입력값까지의 최소계산수를 계산한다
'''